import React from 'react';
import Option from "./Option";
import {IGoodOption} from "../../interfaces/GoodOptions";

const Options = () => {
    const options:IGoodOption[] = [
        {
            title: 'Опция 1',
            subTitle: 'Подзаголовок опции',
            texts: [],
            listLeft: ['2G (GPRS/EDGE)', '3G (WCDMA /UMTS/HSPA)', '4G (LTE)'],
            listRight: ['2G (GPRS/EDGE)', '3G (WCDMA/UMTS/HSPA)', '4G (LTE)', '5G']
        },
        {
            title: 'Опция 2',
            subTitle: 'Подзаголовок опции',
            texts: [],
            listLeft: ['2G (GPRS/EDGE)', '3G (WCDMA/UMTS/HSPA)', '4G (LTE)'],
            listRight: ['2G (GPRS/EDGE)', '3G (WCDMA/UMTS/HSPA)', '4G (LTE)', '5G']
        },
        {
            title: 'Опция 3',
            subTitle: 'Подзаголовок опции',
            texts: [
                'Камера TrueDepth (діафрагма ƒ/2.2)/режим "Портрет" з поліпшеним ефектом боке та функцією "Глибина"/портретне освітлення (шість варіантів: денне світло, студійне світло, контурне світло, сценічне світло, сценічне світло - ч/б, світла тональність - ч/б)/Animoji і Memoji/знімання відео 4K з частотою 24, 30 або 60 кадрів/сек/знімання HD-відео 1080p з частотою 30 або 60 кадрів/сек/запис уповільненого відео 1080р з частотою 120 кадрів/сек/функція Smart HDR нового покоління для фото/розширений динамічний діапазон під час знімання відео з частотою 30 кадрів/сек/кінематографічна стабілізація відео (4K, 1080p і 720p)/широкий колірний діапазон для фотографій і Live Photos/спалах Retina Flash/автоматична стабілізація зображення/серійна зйомка',
                'Діафрагма ƒ/2.2/Режим «Портрет» з поліпшеним ефектом боке та функцією «Глибина»/Портретне освітлення (шість варіантів: Природне світло, Студійне світло, Контурне світло, Сценічне світло, Сценічне світло - ч/б, Світла тональність - ч/б)/Animoji і Memoji/Нічний режим/Технологія Deep Fusion/Smart HDR 4/Фотографічні стилі/Режим «Кіноефект» для знімання відео з малою глибиною різкості (1080p з частотою 30 кадрів у секунду)/Знімання HDR-відео у стандарті Dolby Vision до 4K з частотою 60 кадрів у секунду/Знімання відео 4K з частотою 24, 25, 30 або 60 кадрів у секунду/Знімання HD-відео 1080p з частотою 25, 30 або 60 кадрів у секунду/Запис уповільненого відео 1080р з частотою 120 кадрів у секунду/Режим «Таймлапс» зі стабілізацією зображення/Відео «Таймлапс» у Нічному режимі/Кінематографічна стабілізація відео (4K, 1080p і 720p)/Функція QuickTake/Широкий колірний діапазон для фотографій і Live Photos/Корекція спотворень об\'єктива/Серійна зйомка',
            ]
        }
    ];

    return (
        <div className={'options'}>
            <ul className={'p-0 m-0'}>
                {
                    options.map((option, index) => {
                        return (
                            <li key={index}>
                                <Option data={option} />
                            </li>
                        )
                    })
                }
            </ul>
        </div>
    )
}

export default Options;